ARMmbed/mbed-os/libraries/mbed/targets/hal/TARGET_Atmel/TARGET_SAM21/TARGET_SAMR21G18A/PeripheralPins.c
};

uint32_t pinmap_find_sercom_index (PinName pin, const PinMap* map)
{
    uint8_t count = 0;
    while (map->pin != NC) {
        if (map->pin == pin)
            return count;
        map++;
        count++;
    }
    return (uint32_t)NC;
}

uint32_t pinmap_sercom_peripheral (PinName pin1, PinName pin2)
{
    uint8_t index1 = 0, index2 = 0;

    if ((pin1 == (PinName)NC) || (pin2 == (PinName)NC)) {
        return (uint32_t)NC;
    }

    index1 = pinmap_find_sercom_index(pin1, PinMap_SERCOM_PINS);
    index2 = pinmap_find_sercom_index(pin2, PinMap_SERCOM_PINS);

    if (SAM21[index1].com_num[1] == SERCOM_NULL) {
        return SAM21[index1].com_num[0];
    } else {
        if ((SAM21[index1].com_num[0] == SAM21[index2].com_num[0]) || (SAM21[index1].com_num[0] == SAM21[index2].com_num[1])) {
            return SAM21[index1].com_num[0];
        } else {
            return SAM21[index1].com_num[1];
        }
    }
}

uint32_t pinmap_sercom_pad (PinName pin)
{
    uint8_t index = 0;

    if (pin == (PinName)NC)
        return (uint32_t)NC;

    index = pinmap_find_sercom_index(pin, PinMap_SERCOM_PINS);
    return SAM21[index].pad_num;
}

uint32_t find_sercom_pinmux (struct pin_values* PinValues)
{
    switch (PinValues->com) {
        case 0:  // SERCOM0
            switch (PinValues->pin) {
                case PA04:
                    return PINMUX_PA04D_SERCOM0_PAD0;
                    break;
                case PA08:
                    return PINMUX_PA08C_SERCOM0_PAD0;
                    break;
                case PA05:
                    return PINMUX_PA05D_SERCOM0_PAD1;
                    break;
                case PA09:
                    return PINMUX_PA09C_SERCOM0_PAD1;
                    break;
                case PA06:
                    return PINMUX_PA06D_SERCOM0_PAD2;
                    break;
                case PA10:
                    return PINMUX_PA10C_SERCOM0_PAD2;
                    break;
                case PA07:
                    return PINMUX_PA07D_SERCOM0_PAD3;
                    break;
                case PA11:
                    return PINMUX_PA11C_SERCOM0_PAD3;
                    break;
                default:
                    break;
            }
            break;
        case 1:  // SERCOM1
            switch (PinValues->pin) {
                case PA16:
                    return PINMUX_PA16C_SERCOM1_PAD0;
                    break;
                case PA00:
                    return PINMUX_PA00D_SERCOM1_PAD0;
                    break;
                case PA17:
                    return PINMUX_PA17C_SERCOM1_PAD1;
                    break;
                case PA01:
                    return PINMUX_PA01D_SERCOM1_PAD1;
                    break;
                case PA30:
                    return PINMUX_PA30D_SERCOM1_PAD2;
                    break;
                case PA18:
                    return PINMUX_PA18C_SERCOM1_PAD2;
                    break;
                case PA31:
                    return PINMUX_PA31D_SERCOM1_PAD3;
                    break;
                case PA19:
                    return PINMUX_PA19C_SERCOM1_PAD3;
                    break;
                default:
                    break;
            }
            break;
        case 2:  // SERCOM2
            switch (PinValues->pin) {
                case PA08:
                    return PINMUX_PA08D_SERCOM2_PAD0;
                    break;
                case PA12:
                    return PINMUX_PA12C_SERCOM2_PAD0;
                    break;
                case PA09:
                    return PINMUX_PA09D_SERCOM2_PAD1;
                    break;
                case PA13:
                    return PINMUX_PA13C_SERCOM2_PAD1;
                    break;
                case PA10:
                    return PINMUX_PA10D_SERCOM2_PAD2;
                    break;
                case PA14:
                    return PINMUX_PA14C_SERCOM2_PAD2;
                    break;
                case PA11:
                    return PINMUX_PA11D_SERCOM2_PAD3;
                    break;
                case PA15:
                    return PINMUX_PA15C_SERCOM2_PAD3;
                    break;
                default:
                    break;
            }
            break;
        case 3:  // SERCOM3
            switch (PinValues->pin) {
                case PA16:
                    return PINMUX_PA16D_SERCOM3_PAD0;
                    break;
                case PA22:
                    return PINMUX_PA22C_SERCOM3_PAD0;
                    break;
                case PA27:
                    return PINMUX_PA27F_SERCOM3_PAD0;
                    break;
                case PA17:
                    return PINMUX_PA17D_SERCOM3_PAD1;
                    break;
                case PA23:
                    return PINMUX_PA23C_SERCOM3_PAD1;
                    break;
                case PA28:
                    return PINMUX_PA28F_SERCOM3_PAD1;
                    break;
                case PA18:
                    return PINMUX_PA18D_SERCOM3_PAD2;
                    break;
                case PA20:
                    return PINMUX_PA20D_SERCOM3_PAD2;
                    break;
                case PA24:
                    return PINMUX_PA24C_SERCOM3_PAD2;
                    break;
                case PA19:
                    return PINMUX_PA19D_SERCOM3_PAD3;
                    break;
                case PA25:
                    return PINMUX_PA25C_SERCOM3_PAD3;
                    break;
                default:
                    break;
            }
            break;
        case 4:  // SERCOM4
            switch (PinValues->pin) {
                case PA12:
                    return PINMUX_PA12D_SERCOM4_PAD0;
                    break;
                case PB08:
                    return PINMUX_PB08D_SERCOM4_PAD0;
                    break;
                case PC19:
                    return PINMUX_PC19F_SERCOM4_PAD0;
                    break;
                case PA13:
                    return PINMUX_PA13D_SERCOM4_PAD1;
                    break;
                case PB09:
                    return PINMUX_PB09D_SERCOM4_PAD1;
                    break;
                case PB31:
                    return PINMUX_PB31F_SERCOM4_PAD1;
                    break;
                case PA14:
                    return PINMUX_PA14D_SERCOM4_PAD2;
                    break;
                case PB14:
                    return PINMUX_PB14C_SERCOM4_PAD2;
                    break;
                case PB30:
                    return PINMUX_PB30F_SERCOM4_PAD2;
                    break;
                case PA15:
                    return PINMUX_PA15D_SERCOM4_PAD3;
                    break;
                case PB15:
                    return PINMUX_PB15C_SERCOM4_PAD3;
                    break;
                case PC18:
                    return PINMUX_PC18F_SERCOM4_PAD3;
                    break;
                default:
                    break;
            }
            break;
        case 5:  // SERCOM5
            switch (PinValues->pin) {
                case PB16:
                    return PINMUX_PB16C_SERCOM5_PAD0;
                    break;
                case PA22:
                    return PINMUX_PA22D_SERCOM5_PAD0;
                    break;
                case PB02:
                    return PINMUX_PB02D_SERCOM5_PAD0;
                    break;
                case PB30:
                    return PINMUX_PB30D_SERCOM5_PAD0;
                    break;
                case PB17:
                    return PINMUX_PB17C_SERCOM5_PAD1;
                    break;
                case PA23:
                    return PINMUX_PA23D_SERCOM5_PAD1;
                    break;
                case PB03:
                    return PINMUX_PB03D_SERCOM5_PAD1;
                    break;
                case PB31:
                    return PINMUX_PB31D_SERCOM5_PAD1;
                    break;
                case PA24:
                    return PINMUX_PA24D_SERCOM5_PAD2;
                    break;
                case PB00:
                    return PINMUX_PB00D_SERCOM5_PAD2;
                    break;
                case PB22:
                    return PINMUX_PB22D_SERCOM5_PAD2;
                    break;
                case PA20:
                    return PINMUX_PA20C_SERCOM5_PAD2;
                    break;
                case PA25:
                    return PINMUX_PA25D_SERCOM5_PAD3;
                    break;
                case PB23:
                    return PINMUX_PB23D_SERCOM5_PAD3;
                    break;
                default:
                    break;
            }
            break;
    }
    return NC;
}
uint32_t find_mux_setting (PinName output, PinName input, PinName clock, PinName chipsel)
{
    struct pin_values input_values, output_values, clock_values, chipsel_values;
    uint32_t mux_setting = 0;

    input_values.pin = input;
    output_values.pin = output;
    clock_values.pin = clock;
    chipsel_values.pin = chipsel;

    input_values.com = pinmap_sercom_peripheral(input, output);
    output_values.com = input_values.com;
    clock_values.com = input_values.com;
    chipsel_values.com = input_values.com;

